//SPDX-License-Identifier: GPL-3.0-or-later
//Copyright (C) 2026 wang-er-1-2003
// 卷三十五 附录 结构化数据（自动生成，勿手改）
window.JZB_FULU_DATA = {
 "tuiCe": [
  {
   "节": "春分",
   "黄经": 0,
   "日出": "卯正初刻",
   "昼": "四十八刻",
   "日入": "酉正初刻",
   "夜": "四十八刻"
  },
  {
   "节": "春分",
   "黄经": 6,
   "日出": "卯初三刻七分",
   "昼": "四十九刻一分",
   "日入": "酉正初刻八分",
   "夜": "四十六刻十四分"
  },
  {
   "节": "春分",
   "黄经": 12,
   "日出": "卯初二刻十四分",
   "昼": "五十刻二分",
   "日入": "酉正一刻一分",
   "夜": "四十五刻十三分"
  },
  {
   "节": "春分",
   "黄经": 18,
   "日出": "卯初二刻六分",
   "昼": "五十一刻三分",
   "日入": "酉正一刻九分",
   "夜": "四十四刻十二分"
  },
  {
   "节": "春分",
   "黄经": 24,
   "日出": "卯初一刻十三分",
   "昼": "五十二刻四分",
   "日入": "酉正二刻二分",
   "夜": "四十三刻十一分"
  },
  {
   "节": "谷雨",
   "黄经": 30,
   "日出": "卯初一刻六分",
   "昼": "五十三刻三分日入酉正二刻九分",
   "日入": "酉正二刻九分",
   "夜": "四十二刻十二分"
  },
  {
   "节": "谷雨",
   "黄经": 36,
   "日出": "卯初初刻十三分",
   "昼": "五十四刻四分",
   "日入": "酉正三刻二分",
   "夜": "四十一刻十一分"
  },
  {
   "节": "谷雨",
   "黄经": 42,
   "日出": "卯初初刻六分",
   "昼": "五十五刻三分",
   "日入": "酉正三刻九分",
   "夜": "四十刻十二分"
  },
  {
   "节": "谷雨",
   "黄经": 48,
   "日出": "卯初初刻",
   "昼": "五十六刻",
   "日入": "戌初初刻",
   "夜": "四十刻"
  },
  {
   "节": "谷雨",
   "黄经": 54,
   "日出": "寅正三刻九分",
   "昼": "五十六刻十二分",
   "日入": "戌初初刻六分",
   "夜": "三十九刻三分"
  },
  {
   "节": "谷雨",
   "黄经": 63,
   "日出": "寅正三刻一分",
   "昼": "五十七刻十三分",
   "日入": "戌初初刻十四分",
   "夜": "三十八刻二分"
  },
  {
   "节": "芒种",
   "黄经": 75,
   "日出": "寅正二刻八分",
   "昼": "五十八刻十四分",
   "日入": "戌初一刻七分",
   "夜": "三十七刻一分"
  },
  {
   "节": "夏至",
   "黄经": 90,
   "日出": "寅正二刻四分",
   "昼": "五十九刻七分",
   "日入": "戌初一刻十一分",
   "夜": "三十六刻八分"
  },
  {
   "节": "小暑",
   "黄经": 105,
   "日出": "寅正二刻八分",
   "昼": "五十八刻十四分",
   "日入": "戌初一刻七分",
   "夜": "三十七刻一分"
  },
  {
   "节": "小暑",
   "黄经": 117,
   "日出": "寅正三刻一分",
   "昼": "五十七刻十三分",
   "日入": "戌初初刻十四分",
   "夜": "三十八刻二分"
  },
  {
   "节": "小暑",
   "黄经": 126,
   "日出": "寅正三刻九分",
   "昼": "五十六刻十二分",
   "日入": "戌初初刻六分",
   "夜": "三十九刻三分"
  },
  {
   "节": "小暑",
   "黄经": 132,
   "日出": "卯初初刻",
   "昼": "五十六刻",
   "日入": "戌初初刻",
   "夜": "四十刻"
  },
  {
   "节": "小暑",
   "黄经": 138,
   "日出": "卯初初刻六分",
   "昼": "五十五刻三分",
   "日入": "酉正三刻九分",
   "夜": "四十刻十二分"
  },
  {
   "节": "小暑",
   "黄经": 144,
   "日出": "卯初初刻十三分",
   "昼": "五十四刻四分",
   "日入": "酉正三刻二分",
   "夜": "四十一刻十一分"
  },
  {
   "节": "处暑",
   "黄经": 150,
   "日出": "卯初一刻六分",
   "昼": "五十三刻三分",
   "日入": "酉正二刻九分",
   "夜": "四十二刻十二分"
  },
  {
   "节": "处暑",
   "黄经": 156,
   "日出": "卯初一刻十三分",
   "昼": "五十二刻四分",
   "日入": "酉正二刻二分",
   "夜": "四十三刻十一分"
  },
  {
   "节": "处暑",
   "黄经": 162,
   "日出": "卯初二刻六分",
   "昼": "五十一刻三分",
   "日入": "酉正一刻九分",
   "夜": "四十四刻十二分"
  },
  {
   "节": "处暑",
   "黄经": 168,
   "日出": "卯初二刻十四分",
   "昼": "五十刻二分",
   "日入": "酉正一刻一分",
   "夜": "四十五刻十三分"
  },
  {
   "节": "处暑",
   "黄经": 174,
   "日出": "卯初三刻七分",
   "昼": "四十九刻一分",
   "日入": "酉正初刻八分",
   "夜": "四十六刻十四分"
  },
  {
   "节": "秋分",
   "黄经": 180,
   "日出": "卯正初刻",
   "昼": "四十八刻",
   "日入": "酉正初刻",
   "夜": "四十八刻"
  },
  {
   "节": "秋分",
   "黄经": 186,
   "日出": "卯正初刻八分",
   "昼": "四十六刻十四分",
   "日入": "酉初三刻七分",
   "夜": "四十九刻一分"
  },
  {
   "节": "秋分",
   "黄经": 192,
   "日出": "卯正一刻一分",
   "昼": "四十五刻十三分",
   "日入": "酉初二刻十四分",
   "夜": "五十刻二分"
  },
  {
   "节": "秋分",
   "黄经": 198,
   "日出": "卯正一刻九分",
   "昼": "四十四刻十二分",
   "日入": "酉初二刻六分",
   "夜": "五十一刻三分"
  },
  {
   "节": "秋分",
   "黄经": 204,
   "日出": "卯正二刻二分",
   "昼": "四十三刻十一分",
   "日入": "酉初一刻十三分",
   "夜": "五十二刻四分"
  },
  {
   "节": "霜降",
   "黄经": 210,
   "日出": "卯正二刻九分",
   "昼": "四十二刻十二分",
   "日入": "酉初一刻六分",
   "夜": "五十三刻三分"
  },
  {
   "节": "霜降",
   "黄经": 216,
   "日出": "卯正三刻二分",
   "昼": "四十一刻十一分",
   "日入": "酉初初刻十三分",
   "夜": "五十四刻四分"
  },
  {
   "节": "霜降",
   "黄经": 222,
   "日出": "卯正三刻九分",
   "昼": "四十刻十二分",
   "日入": "酉初初刻六分",
   "夜": "五十五刻三分"
  },
  {
   "节": "霜降",
   "黄经": 228,
   "日出": "辰初初刻",
   "昼": "四十刻",
   "日入": "酉初初刻",
   "夜": "五十六刻"
  },
  {
   "节": "霜降",
   "黄经": 234,
   "日出": "辰初初刻六分",
   "昼": "三十九刻三分",
   "日入": "申正三刻九分",
   "夜": "五十六刻十二分"
  },
  {
   "节": "霜降",
   "黄经": 243,
   "日出": "辰初初刻十四分",
   "昼": "三十八刻二分",
   "日入": "申正三刻一分",
   "夜": "五十七刻十三分"
  },
  {
   "节": "大雪",
   "黄经": 255,
   "日出": "辰初一刻七分",
   "昼": "三十七刻一分",
   "日入": "申正二刻八分",
   "夜": "五十八刻十四分"
  },
  {
   "节": "冬至",
   "黄经": 270,
   "日出": "辰初一刻十一分",
   "昼": "三十六刻八分",
   "日入": "申正二刻四分",
   "夜": "五十九刻七分"
  },
  {
   "节": "小寒",
   "黄经": 285,
   "日出": "辰初一刻七分",
   "昼": "三十七刻一分",
   "日入": "申正二刻八分",
   "夜": "五十八刻十四分"
  },
  {
   "节": "小寒",
   "黄经": 297,
   "日出": "辰初初刻十四分",
   "昼": "三十八刻二分",
   "日入": "申正三刻一分",
   "夜": "五十七刻十三分"
  },
  {
   "节": "小寒",
   "黄经": 306,
   "日出": "辰初初刻六分",
   "昼": "三十九刻三分",
   "日入": "申正三刻九分",
   "夜": "五十六刻十二分"
  },
  {
   "节": "小寒",
   "黄经": 312,
   "日出": "辰初初刻",
   "昼": "四十刻",
   "日入": "酉初初刻",
   "夜": "五十六刻"
  },
  {
   "节": "小寒",
   "黄经": 318,
   "日出": "卯正三刻九分",
   "昼": "四十刻十二分",
   "日入": "酉初初刻六分",
   "夜": "五十五刻三分"
  },
  {
   "节": "小寒",
   "黄经": 324,
   "日出": "卯正三刻二分",
   "昼": "四十一刻十一分",
   "日入": "酉初初刻十三分",
   "夜": "五十四刻四分"
  },
  {
   "节": "雨水",
   "黄经": 330,
   "日出": "卯正二刻九分",
   "昼": "四十二刻十二分",
   "日入": "酉初一刻六分",
   "夜": "五十三刻三分"
  },
  {
   "节": "雨水",
   "黄经": 336,
   "日出": "卯正二刻二分",
   "昼": "四十三刻十一分",
   "日入": "酉初一刻十三分",
   "夜": "五十二刻四分"
  },
  {
   "节": "雨水",
   "黄经": 342,
   "日出": "卯正一刻九分",
   "昼": "四十四刻十二分",
   "日入": "酉初二刻六分",
   "夜": "五十一刻三分"
  },
  {
   "节": "雨水",
   "黄经": 348,
   "日出": "卯正一刻一分",
   "昼": "四十五刻十三分",
   "日入": "酉初二刻十四分",
   "夜": "五十刻二分"
  },
  {
   "节": "雨水",
   "黄经": 354,
   "日出": "卯正初刻八分",
   "昼": "四十六刻十四分日入酉初三刻七分",
   "日入": "酉初三刻七分",
   "夜": "四十九刻一分"
  }
 ],
 "jiuGong": {
  "yuanStart": {
   "上元": 1864,
   "中元": 1924,
   "下元": 1984
  },
  "maleStart": {
   "上元": 1,
   "中元": 4,
   "下元": 7
  },
  "femaleStart": {
   "上元": 5,
   "中元": 2,
   "下元": 8
  }
 },
 "renShen": {
  "d30": [
   "足大指",
   "外踝",
   "股内",
   "腰",
   "口",
   "手",
   "内踝",
   "腕",
   "尻",
   "腰背",
   "鼻柱",
   "发际",
   "牙齿",
   "胃脘",
   "遍身",
   "胸",
   "气冲",
   "股内",
   "足",
   "内踝",
   "手小指",
   "外踝",
   "肝及足",
   "手阳明",
   "足阳明",
   "胸",
   "膝",
   "阴",
   "膝胫",
   "足趺"
  ],
  "gan": [
   "头",
   "项",
   "肩背",
   "胸胁",
   "腹",
   "背",
   "膝",
   "脾",
   "肾",
   "足"
  ],
  "zhi": [
   "目",
   "耳",
   "胸",
   "鼻",
   "腰",
   "手",
   "心腹",
   "足",
   "头",
   "背",
   "头",
   "项"
  ],
  "shi": [
   "踝",
   "头",
   "耳",
   "面",
   "项",
   "乳",
   "胸",
   "腹",
   "心",
   "膝",
   "腰",
   "股"
  ]
 },
 "taiBai": [
  "正东",
  "东南",
  "正南",
  "西南",
  "正西",
  "西北",
  "正北",
  "东北",
  "中方",
  "在天",
  "正东",
  "东南",
  "正南",
  "西南",
  "正西",
  "西北",
  "正北",
  "东北",
  "中方",
  "在天",
  "正东",
  "东南",
  "正南",
  "西南",
  "正西",
  "西北",
  "正北",
  "东北",
  "中方",
  "在天"
 ],
 "changDuan": {
  "长星": {
   "1": [
    7
   ],
   "2": [
    4
   ],
   "3": [
    1
   ],
   "4": [
    9
   ],
   "5": [
    15
   ],
   "6": [
    10
   ],
   "7": [
    8
   ],
   "8": [
    2,
    5
   ],
   "9": [
    3,
    4
   ],
   "10": [
    1
   ],
   "11": [
    12
   ],
   "12": [
    9
   ]
  },
  "短星": {
   "1": [
    21
   ],
   "2": [
    19
   ],
   "3": [
    16
   ],
   "4": [
    25
   ],
   "5": [
    25
   ],
   "6": [
    20
   ],
   "7": [
    22
   ],
   "8": [
    18,
    19
   ],
   "9": [
    16,
    17
   ],
   "10": [
    14
   ],
   "11": [
    20,
    22
   ],
   "12": [
    25
   ]
  }
 },
 "baiJi": {
  "gan": [
   "甲不开仓",
   "乙不栽植",
   "丙不修灶",
   "丁不剃头",
   "戊不受田",
   "己不破券",
   "庚不经络",
   "辛不合酱",
   "壬不决水",
   "癸不词讼"
  ],
  "zhi": [
   "子不问卜",
   "丑不冠带",
   "寅不祭祀",
   "卯不穿井",
   "辰不哭泣",
   "巳不远行",
   "午不苫盖",
   "未不服药",
   "申不安床",
   "酉不会客",
   "戌不乞狗",
   "亥不嫁娶"
  ]
 },
 "xiTou": {
  "yiRi": [
   3,
   4,
   8,
   9,
   10,
   11,
   13,
   14,
   15,
   22,
   23,
   26,
   27
  ],
  "yiZhi": [
   8,
   9,
   11,
   0
  ]
 },
 "zhouTang": {
  "wei": [
   "乾(翁)",
   "坎(第)",
   "艮(灶)",
   "震(妇)",
   "巽(厨)",
   "离(夫)",
   "坤(姑)",
   "兑(堂)"
  ]
 },
 "tianTang": {
  "甲": "乾",
  "乙": "坤",
  "丙": "艮",
  "丁": "兑",
  "戊": "坎",
  "己": "离",
  "庚": "震",
  "辛": "巽",
  "壬": "乾",
  "癸": "坤"
 },
 "qiMen": {
  "yang": {
   "冬至": [
    1,
    7,
    4
   ],
   "小寒": [
    2,
    8,
    5
   ],
   "大寒": [
    3,
    9,
    6
   ],
   "立春": [
    8,
    5,
    2
   ],
   "雨水": [
    9,
    6,
    3
   ],
   "惊蛰": [
    1,
    7,
    4
   ],
   "春分": [
    3,
    9,
    6
   ],
   "清明": [
    4,
    1,
    7
   ],
   "谷雨": [
    5,
    2,
    8
   ],
   "立夏": [
    4,
    1,
    7
   ],
   "小满": [
    5,
    2,
    8
   ],
   "芒种": [
    6,
    3,
    9
   ]
  },
  "yin": {
   "夏至": [
    9,
    3,
    6
   ],
   "小暑": [
    8,
    2,
    5
   ],
   "大暑": [
    7,
    1,
    4
   ],
   "立秋": [
    2,
    5,
    8
   ],
   "处暑": [
    1,
    4,
    7
   ],
   "白露": [
    9,
    3,
    6
   ],
   "秋分": [
    7,
    1,
    4
   ],
   "寒露": [
    6,
    9,
    3
   ],
   "霜降": [
    5,
    8,
    2
   ],
   "立冬": [
    6,
    9,
    3
   ],
   "小雪": [
    5,
    8,
    2
   ],
   "大雪": [
    4,
    7,
    1
   ]
  },
  "xing": {
   "1": [
    "天蓬",
    "休"
   ],
   "2": [
    "天芮",
    "死"
   ],
   "3": [
    "天冲",
    "伤"
   ],
   "4": [
    "天辅",
    "杜"
   ],
   "5": [
    "天禽",
    null
   ],
   "6": [
    "天心",
    "开"
   ],
   "7": [
    "天柱",
    "惊"
   ],
   "8": [
    "天任",
    "生"
   ],
   "9": [
    "天英",
    "景"
   ]
  }
 },
 "zaYong": {
  "qigongJiaMa": {},
  "dingSangShanJia": {},
  "xiuChu": {
   "1": {
    "inner": [
     "戊寅"
    ],
    "outer": []
   },
   "2": {
    "inner": [
     "乙亥",
     "丙寅",
     "癸丑",
     "戊寅",
     "甲申",
     "辛未",
     "甲寅",
     "己未",
     "丙寅",
     "己巳",
     "戊寅",
     "甲申",
     "甲寅",
     "庚申"
    ],
    "outer": []
   },
   "3": {
    "inner": [
     "己巳",
     "甲申"
    ],
    "outer": [
     "丙子",
     "甲子",
     "庚子",
     "壬子"
    ]
   },
   "4": {
    "inner": [
     "癸丑",
     "乙卯",
     "庚申"
    ],
    "outer": []
   },
   "5": {
    "inner": [
     "丙寅",
     "己巳",
     "辛未",
     "戊寅",
     "甲寅",
     "庚寅",
     "壬辰",
     "癸未",
     "己未"
    ],
    "outer": []
   },
   "6": {
    "inner": [
     "丙寅",
     "戊寅",
     "甲寅",
     "辛亥",
     "甲申",
     "庚申"
    ],
    "outer": []
   },
   "7": {
    "inner": [
     "壬子",
     "丙辰",
     "庚申"
    ],
    "outer": []
   },
   "8": {
    "inner": [
     "丙寅",
     "庚寅",
     "戊寅",
     "壬子",
     "庚申",
     "乙亥"
    ],
    "outer": []
   },
   "9": {
    "inner": [
     "己未",
     "丙午",
     "辛卯"
    ],
    "outer": []
   },
   "10": {
    "inner": [
     "辛未",
     "乙未",
     "庚子",
     "丁未",
     "壬子"
    ],
    "outer": []
   }
  },
  "zaoMen": {
   "1": {
    "inner": [
     "癸酉"
    ],
    "outer": [
     "丁酉"
    ]
   },
   "2": {
    "inner": [
     "甲申",
     "己亥",
     "甲寅",
     "甲子",
     "甲申",
     "甲寅",
     "庚子"
    ],
    "outer": [
     "庚申"
    ]
   },
   "3": {
    "inner": [
     "癸酉"
    ],
    "outer": [
     "丁酉"
    ]
   },
   "4": {
    "inner": [
     "甲子"
    ],
    "outer": [
     "庚午"
    ]
   },
   "5": {
    "inner": [
     "辛未"
    ],
    "outer": []
   },
   "6": {
    "inner": [
     "甲申",
     "甲寅"
    ],
    "outer": [
     "庚申"
    ]
   },
   "7": {
    "inner": [
     "庚子",
     "壬子"
    ],
    "outer": []
   },
   "8": {
    "inner": [
     "乙丑"
    ],
    "outer": [
     "乙亥"
    ]
   },
   "9": {
    "inner": [],
    "outer": [
     "庚午",
     "丙午"
    ]
   },
   "10": {
    "inner": [
     "甲子",
     "辛未",
     "庚子",
     "乙未"
    ],
    "outer": [
     "庚午"
    ]
   }
  },
  "suHui": {
   "1": {
    "inner": [
     "丁酉"
    ],
    "outer": [
     "癸酉"
    ]
   },
   "2": {
    "inner": [
     "癸未",
     "乙亥",
     "辛亥"
    ],
    "outer": [
     "甲申",
     "丁未",
     "己未",
     "丙寅",
     "戊寅",
     "甲申",
     "甲寅",
     "庚申"
    ]
   },
   "3": {
    "inner": [
     "丁酉"
    ],
    "outer": [
     "癸酉",
     "甲申"
    ]
   },
   "4": {
    "inner": [
     "戊午"
    ],
    "outer": [
     "甲子",
     "丁丑",
     "庚午"
    ]
   },
   "5": {
    "inner": [
     "癸未",
     "壬寅",
     "辛亥",
     "丙辰"
    ],
    "outer": [
     "丙寅",
     "辛未",
     "戊寅",
     "甲辰"
    ]
   },
   "6": {
    "inner": [
     "乙亥",
     "丁酉",
     "癸未",
     "壬寅",
     "辛亥"
    ],
    "outer": [
     "丙寅",
     "庚申",
     "甲申"
    ]
   },
   "7": {
    "inner": [
     "丙辰"
    ],
    "outer": [
     "戊辰",
     "甲子",
     "丙子",
     "庚子"
    ]
   },
   "8": {
    "inner": [
     "乙亥",
     "庚寅",
     "壬寅",
     "辛亥",
     "丙辰"
    ],
    "outer": [
     "乙丑",
     "壬辰",
     "丁巳"
    ]
   },
   "9": {
    "inner": [
     "戊午"
    ],
    "outer": [
     "庚午",
     "辛卯",
     "癸卯",
     "丙午",
     "壬午"
    ]
   },
   "10": {
    "inner": [
     "丁酉",
     "丙辰",
     "戊午"
    ],
    "outer": [
     "甲子",
     "庚午",
     "辛未",
     "乙未",
     "丁未",
     "庚寅"
    ]
   }
  },
  "zuoNiuLan": {
   "1": {
    "inner": [
     "庚寅"
    ],
    "outer": []
   },
   "2": {
    "inner": [],
    "outer": [
     "戊寅",
     "乙丑",
     "丙寅",
     "戊寅",
     "甲寅"
    ]
   },
   "3": {
    "inner": [
     "己巳"
    ],
    "outer": []
   },
   "4": {
    "inner": [
     "庚午",
     "壬午"
    ],
    "outer": []
   },
   "5": {
    "inner": [
     "己巳",
     "壬辰"
    ],
    "outer": [
     "乙未",
     "丙辰"
    ]
   },
   "6": {
    "inner": [
     "庚申"
    ],
    "outer": [
     "甲申",
     "乙未"
    ]
   },
   "7": {
    "inner": [
     "戊申",
     "庚申"
    ],
    "outer": []
   },
   "8": {
    "inner": [],
    "outer": [
     "乙丑"
    ]
   },
   "9": {
    "inner": [
     "甲戌"
    ],
    "outer": []
   },
   "10": {
    "inner": [
     "甲子",
     "丙子",
     "庚子",
     "壬子"
    ],
    "outer": []
   }
  },
  "zuoMaFang": {
   "1": {
    "inner": [
     "丁卯",
     "乙亥",
     "己卯"
    ],
    "outer": [
     "庚午"
    ]
   },
   "2": {
    "inner": [
     "辛未",
     "甲子",
     "戊子",
     "庚子"
    ],
    "outer": [
     "丁未",
     "己未",
     "丙寅",
     "甲寅"
    ]
   },
   "3": {
    "inner": [
     "丁卯",
     "己卯",
     "甲申",
     "己巳"
    ],
    "outer": []
   },
   "4": {
    "inner": [
     "甲子",
     "戊子",
     "庚子"
    ],
    "outer": [
     "庚午"
    ]
   },
   "5": {
    "inner": [
     "辛未",
     "壬辰"
    ],
    "outer": [
     "丙辰"
    ]
   },
   "6": {
    "inner": [
     "辛未",
     "乙亥",
     "甲申"
    ],
    "outer": [
     "庚申"
    ]
   },
   "7": {
    "inner": [
     "甲子",
     "辛未",
     "丙子",
     "戊子",
     "庚子",
     "壬子"
    ],
    "outer": []
   },
   "8": {
    "inner": [
     "壬辰"
    ],
    "outer": [
     "乙丑",
     "甲戌",
     "丙辰"
    ]
   },
   "9": {
    "inner": [],
    "outer": [
     "辛酉"
    ]
   },
   "10": {
    "inner": [
     "甲子",
     "辛未",
     "庚子",
     "壬子"
    ],
    "outer": [
     "庚午",
     "乙未"
    ]
   }
  },
  "yangCan": {
   "1": {
    "inner": [
     "癸酉",
     "癸卯",
     "甲寅",
     "丁卯",
     "庚午",
     "壬午",
     "丙午"
    ],
    "outer": []
   },
   "2": {
    "inner": [
     "甲寅",
     "乙巳",
     "戊寅",
     "庚寅",
     "乙卯",
     "戊申",
     "甲寅",
     "庚寅",
     "戊寅",
     "甲申",
     "乙巳"
    ],
    "outer": []
   },
   "3": {
    "inner": [
     "丁卯",
     "癸卯",
     "乙巳",
     "甲申",
     "戊申"
    ],
    "outer": []
   },
   "4": {
    "inner": [
     "丁卯",
     "庚午",
     "壬午",
     "癸卯",
     "甲子",
     "丙子"
    ],
    "outer": []
   },
   "5": {
    "inner": [
     "乙未",
     "丁未",
     "戊寅",
     "甲寅",
     "乙巳",
     "庚午",
     "壬午",
     "庚寅"
    ],
    "outer": []
   },
   "6": {
    "inner": [
     "甲寅",
     "乙未",
     "甲申",
     "戊申",
     "癸酉",
     "庚寅",
     "戊寅"
    ],
    "outer": []
   },
   "7": {
    "inner": [
     "甲子",
     "丙子",
     "癸酉",
     "乙未"
    ],
    "outer": []
   },
   "8": {
    "inner": [
     "甲申",
     "戊申",
     "乙巳"
    ],
    "outer": []
   },
   "9": {
    "inner": [
     "庚午",
     "癸酉",
     "壬午",
     "丙午"
    ],
    "outer": []
   },
   "10": {
    "inner": [
     "甲子",
     "庚子",
     "癸酉",
     "壬午",
     "丁未",
     "乙未"
    ],
    "outer": []
   }
  },
  "zhanCao": {
   "1": {
    "inner": [
     "庚午",
     "己卯",
     "壬午",
     "乙酉",
     "庚寅",
     "丙午",
     "丁酉",
     "癸丑",
     "戊午",
     "辛卯",
     "乙卯"
    ],
    "outer": [
     "丁卯",
     "癸卯",
     "己卯"
    ]
   },
   "2": {
    "inner": [
     "庚午",
     "壬午",
     "甲午",
     "丙午",
     "壬申",
     "甲申",
     "丙申",
     "壬寅",
     "甲寅",
     "甲子",
     "庚寅",
     "丙午",
     "庚申",
     "癸丑",
     "甲子",
     "乙酉",
     "丁酉",
     "丙午",
     "庚申",
     "戊午",
     "戊辰",
     "庚辰",
     "壬辰",
     "丙辰",
     "戊寅"
    ],
    "outer": [
     "丙寅",
     "庚寅",
     "壬寅",
     "甲寅"
    ]
   },
   "3": {
    "inner": [
     "壬申",
     "甲申",
     "甲子",
     "乙酉",
     "庚寅",
     "丁酉",
     "丙午",
     "癸丑",
     "辛巳",
     "癸巳",
     "乙巳",
     "丁巳"
    ],
    "outer": []
   },
   "4": {
    "inner": [
     "甲子",
     "乙丑",
     "庚午",
     "壬午",
     "辛卯",
     "甲子",
     "乙酉",
     "庚寅",
     "丁酉",
     "庚申",
     "癸丑",
     "戊午",
     "庚午",
     "壬午",
     "甲午",
     "戊午"
    ],
    "outer": []
   },
   "5": {
    "inner": [
     "乙丑",
     "壬寅",
     "癸丑",
     "甲寅",
     "乙酉",
     "庚寅",
     "庚申",
     "乙未",
     "己未"
    ],
    "outer": [
     "辛未"
    ]
   },
   "6": {
    "inner": [
     "丁卯",
     "壬申",
     "甲申",
     "辛卯",
     "丙申",
     "癸卯",
     "乙卯",
     "甲子",
     "乙酉",
     "庚寅",
     "丁酉",
     "丙午",
     "庚申",
     "壬申",
     "甲申",
     "丙申",
     "庚申"
    ],
    "outer": []
   },
   "7": {
    "inner": [
     "甲子",
     "丁卯",
     "己卯",
     "壬午",
     "辛卯",
     "癸卯",
     "丙午",
     "乙卯",
     "甲子",
     "乙酉",
     "丙午",
     "丁酉",
     "癸丑",
     "戊午",
     "己酉"
    ],
    "outer": [
     "癸酉",
     "丁酉",
     "乙酉",
     "辛酉"
    ]
   },
   "8": {
    "inner": [
     "乙卯",
     "壬辰",
     "戊辰",
     "癸丑",
     "甲子",
     "庚寅",
     "庚申",
     "戊午",
     "甲戌",
     "丙戌",
     "戊戌",
     "庚戌",
     "壬戌"
    ],
    "outer": []
   },
   "9": {
    "inner": [
     "庚午",
     "壬午",
     "辛卯",
     "癸卯",
     "丙午",
     "乙卯",
     "丁卯",
     "甲子",
     "乙酉",
     "庚寅",
     "丁酉",
     "丙午",
     "庚申",
     "戊子",
     "辛亥"
    ],
    "outer": [
     "乙亥",
     "癸亥",
     "丁亥"
    ]
   },
   "10": {
    "inner": [
     "甲子",
     "丁卯",
     "庚午",
     "辛未",
     "己卯",
     "辛卯",
     "乙卯",
     "丙午",
     "壬申",
     "甲申",
     "乙未",
     "丙申",
     "甲子",
     "庚寅",
     "丁酉",
     "丙午",
     "乙酉",
     "庚申",
     "戊子",
     "丙子",
     "庚子"
    ],
    "outer": [
     "甲子",
     "戊子"
    ]
   }
  },
  "chengFu": {},
  "chuFu": {}
 },
 "ruGuan": {
  "子": "甲庚",
  "丑": "乙辛",
  "寅": "乙癸",
  "卯": "丙壬",
  "辰": "丁甲",
  "巳": "乙庚",
  "午": "丁癸",
  "未": "乙辛",
  "申": "甲癸",
  "酉": "丁壬",
  "戌": "庚壬",
  "亥": "乙辛"
 },
 "ruLian": {
  "甲子": "申酉",
  "乙丑": "日出",
  "丙寅": "亥子",
  "丁卯": "寅卯午",
  "戊辰": "己申",
  "己巳": "巳午申",
  "庚午": "辰巳",
  "辛未": "己午丑未",
  "壬申": "未申亥",
  "癸酉": "辰申",
  "甲戌": "日入",
  "乙亥": "酉亥",
  "丙子": "日出",
  "丁丑": "寅卯",
  "戊寅": "辰巳",
  "己卯": "己申",
  "庚辰": "己申",
  "辛巳": "己未丑",
  "壬午": "己未",
  "癸未": "丑未",
  "甲申": "酉亥",
  "乙酉": "申酉",
  "丙戌": "戌亥",
  "丁亥": "己未",
  "戊子": "寅申",
  "己丑": "丑未",
  "庚寅": "丑申",
  "辛卯": "丑未",
  "壬辰": "日入",
  "癸巳": "丑未",
  "甲午": "己未",
  "乙未": "日入",
  "丙申": "日出",
  "丁酉": "寅卯辰",
  "戊戌": "己申",
  "己亥": "己申",
  "庚子": "戌亥",
  "辛丑": "丑寅",
  "壬寅": "亥子",
  "癸卯": "丑未",
  "甲辰": "寅申",
  "乙巳": "亥子",
  "丙午": "寅卯",
  "丁未": "亥子",
  "戊申": "寅申",
  "己酉": "己申",
  "庚戌": "己申",
  "辛亥": "己未",
  "壬子": "辰戌",
  "癸丑": "丑未",
  "甲寅": "寅申酉",
  "乙卯": "申酉",
  "丙辰": "己亥",
  "丁巳": "亥子",
  "戊午": "己申",
  "己未": "午申",
  "庚申": "辰巳",
  "辛酉": "寅申",
  "壬戌": "丑寅",
  "癸亥": "己申"
 },
 "wuXingZhai": {
  "宫": "土",
  "商": "金",
  "角": "木",
  "徵": "火",
  "羽": "水"
 },
 "douShouShan": {
  "土": [
   "壬",
   "子",
   "巽",
   "巳",
   "辛",
   "戌"
  ],
  "金": [
   "乙",
   "辰",
   "庚",
   "酉"
  ],
  "水": [
   "甲",
   "卯",
   "坤",
   "申"
  ],
  "木": [
   "艮",
   "寅",
   "丁",
   "未"
  ],
  "火": [
   "癸",
   "丑",
   "丙",
   "午",
   "乾",
   "亥"
  ]
 },
 "zunDiSeq": [
  6,
  7,
  8,
  9,
  1,
  2,
  3,
  4
 ],
 "liuDao": [
  "艮坤",
  "甲庚",
  "乙辛",
  "巽乾",
  "丙壬",
  "丁癸"
 ],
 "liuDaoName": [
  "天道",
  "地道",
  "兵道",
  "人道",
  "鬼道",
  "死道"
 ],
 "zhiTui": {
  "子": "巳",
  "丑": "辰",
  "寅": "卯",
  "卯": "寅",
  "辰": "丑",
  "巳": "子",
  "午": "亥",
  "未": "戌",
  "申": "酉",
  "酉": "申",
  "戌": "未",
  "亥": "午"
 },
 "hongSha": {
  "寅": "酉",
  "申": "酉",
  "巳": "酉",
  "亥": "酉",
  "子": "巳",
  "午": "巳",
  "卯": "巳",
  "酉": "巳",
  "辰": "丑",
  "戌": "丑",
  "丑": "丑",
  "未": "丑"
 },
 "siBuXiang": [
  4,
  7,
  16,
  19,
  28
 ],
 "yangGongJiList": {
  "1": [
   13
  ],
  "2": [
   11
  ],
  "3": [
   9
  ],
  "4": [
   7
  ],
  "5": [
   5
  ],
  "6": [
   3
  ],
  "7": [
   1,
   29
  ],
  "8": [
   27
  ],
  "9": [
   25
  ],
  "10": [
   23
  ],
  "11": [
   21
  ],
  "12": [
   19
  ]
 },
 "tianGou": {
  "春": [
   "酉",
   "卯"
  ],
  "夏": [
   "午",
   "子"
  ],
  "秋": [
   "卯",
   "酉"
  ],
  "冬": [
   "子",
   "午"
  ]
 },
 "tongWei": {
  "浮天空亡": "头白空亡 / 八山空亡",
  "坐煞向煞": "翎毛禁向 / 八山刀砧",
  "六害": "阴中太岁 / 阴中煞",
  "小耗": "净栏煞"
 },
 "jiuXian": {
  "吉": [
   10,
   13,
   15,
   16,
   18,
   25,
   26
  ],
  "凶": [
   14,
   17,
   19,
   20,
   23,
   27
  ],
  "例": "丙寅日巳时：丙七寅七巳四共十八（天德仙）"
 },
 "heHun": {
  "坎": [
   "伏位",
   "绝命",
   "天医",
   "五鬼",
   "六煞",
   "祸害",
   "生气",
   "延年"
  ],
  "坤": [
   "天医",
   "伏位",
   "祸害",
   "五鬼",
   "六煞",
   "绝命",
   "生气",
   "延年"
  ],
  "震": [
   "天医",
   "祸害",
   "伏位",
   "延年",
   "五鬼",
   "绝命",
   "六煞",
   "生气"
  ],
  "巽": [
   "生气",
   "祸害",
   "延年",
   "伏位",
   "五鬼",
   "六煞",
   "绝命",
   "天医"
  ],
  "乾": [
   "六煞",
   "绝命",
   "祸害",
   "五鬼",
   "伏位",
   "生气",
   "天医",
   "延年"
  ],
  "兑": [
   "祸害",
   "绝命",
   "五鬼",
   "六煞",
   "生气",
   "伏位",
   "延年",
   "天医"
  ],
  "艮": [
   "五鬼",
   "生气",
   "六煞",
   "绝命",
   "天医",
   "延年",
   "伏位",
   "祸害"
  ],
  "离": [
   "绝命",
   "延年",
   "生气",
   "天医",
   "绝命",
   "祸害",
   "六煞",
   "伏位"
  ]
 },
 "heHunMap": {
  "延年": "福德",
  "六煞": "绝体",
  "祸害": "游魂"
 },
 "heHunLevel": {
  "生气": "上吉·子孙昌盛",
  "天医": "上吉·子孙昌盛",
  "福德": "上吉·子孙昌盛",
  "绝体": "中等",
  "游魂": "中等",
  "归魂": "中等",
  "五鬼": "凶·口舌",
  "绝命": "凶·多忧"
 }
};
