//SPDX-License-Identifier: GPL-3.0-or-later
//Copyright (C) 2026 wang-er-1-2003
window.JZB_RI32 = {
"shichen": {
"甲子": {
"子": [
"日建",
"金匮"
],
"丑": [
"天乙贵人",
"日合",
"宝光"
],
"寅": [
"日禄",
"喜神",
"福星贵人",
"日马",
"白虎"
],
"卯": [
"玉堂",
"日刑"
],
"辰": [
"天牢"
],
"巳": [
"元武"
],
"午": [
"司命",
"日破",
"五不遇"
],
"未": [
"天乙贵人",
"日害",
"勾陈"
],
"申": [
"青龙",
"路空"
],
"酉": [
"天官贵人",
"明堂",
"路空"
],
"戌": [
"天刑",
"旬空"
],
"亥": [
"朱雀",
"旬空"
]
},
"乙丑": {
"子": [
"天乙贵人",
"日合",
"天刑"
],
"丑": [
"福星贵人",
"日建",
"朱雀"
],
"寅": [
"金匮"
],
"卯": [
"日禄",
"宝光"
],
"辰": [
"白虎"
],
"巳": [
"玉堂",
"五不遇"
],
"午": [
"路空",
"日害",
"天牢"
],
"未": [
"路空",
"日破",
"元武"
],
"申": [
"天乙贵人",
"天官贵人",
"司命"
],
"酉": [
"勾陈"
],
"戌": [
"喜神",
"青龙",
"日刑",
"旬空"
],
"亥": [
"福星贵人",
"日马",
"明堂",
"旬空"
]
},
"丙寅": {
"子": [
"天官贵人",
"福星贵人"
],
"丑": [
"青龙"
],
"寅": [
"明堂",
"日建"
],
"卯": [
"天刑"
],
"辰": [
"朱雀",
"金匮",
"五不遇"
],
"巳": [
"路空",
"日禄",
"宝光",
"路空",
"日害"
],
"午": [
"日刑"
],
"未": [
"白虎"
],
"申": [
"玉堂",
"喜神",
"日马",
"日破"
],
"酉": [
"天牢"
],
"戌": [
"元武"
],
"亥": [
"旬空",
"天乙贵人"
]
},
"丁卯": {
"子": [
"勾陈"
],
"寅": [
"日刑"
],
"卯": [
"青龙",
"路空",
"日建",
"明堂"
],
"辰": [
"五不遇"
],
"巳": [
"日害"
],
"午": [
"日马",
"朱雀"
],
"酉": [
"宝光",
"白虎",
"天乙贵人"
],
"戌": [
"玉堂"
],
"亥": [
"日合",
"天牢"
]
},
"戊辰": {
"丑": [
"元武",
"旬空",
"路空"
],
"寅": [
"天牢",
"天乙贵人"
],
"卯": [
"元武",
"日马",
"司命"
],
"辰": [
"喜神",
"日建",
"青龙",
"日刑"
],
"巳": [
"日禄",
"明堂"
],
"午": [
"天刑"
],
"未": [
"天乙贵人"
],
"申": [
"福星贵人"
],
"酉": [
"金匮",
"日合"
],
"戌": [
"宝光",
"路空",
"日破",
"白虎"
],
"亥": [
"旬空",
"玉堂",
"路空"
]
},
"己巳": {
"子": [
"旬空"
],
"丑": [
"白虎",
"玉堂"
],
"寅": [
"五不遇",
"喜神",
"天官贵人"
],
"卯": [
"日害"
],
"辰": [
"天牢"
],
"巳": [
"元武",
"司命"
],
"午": [
"日建",
"勾陈"
],
"未": [
"日禄",
"青龙"
],
"申": [
"明堂",
"天乙贵人",
"日合"
],
"酉": [
"路空",
"日刑"
],
"戌": [
"天刑",
"路空"
],
"亥": [
"朱雀",
"金匮",
"旬空",
"日马",
"宝光"
]
},
"庚午": {
"子": [
"日破",
"旬空"
],
"丑": [
"五不遇",
"日破"
],
"午": [
"玉堂",
"天牢",
"元武",
"天官贵人"
],
"未": [
"日建",
"司命",
"路空",
"日刑"
],
"申": [
"日禄",
"青龙",
"日马"
],
"戌": [
"喜神",
"五不遇",
"天刑",
"旬空"
],
"亥": [
"朱雀",
"旬空"
]
},
"辛未": {
"子": [
"日害",
"天刑"
],
"丑": [
"日破",
"日刑",
"朱雀"
],
"寅": [
"天乙贵人"
],
"辰": [
"路空"
],
"巳": [
"天官贵人",
"福星贵人",
"日马"
],
"午": [
"路空",
"天乙贵人"
],
"未": [
"日合",
"天牢"
],
"申": [
"日建",
"元武"
],
"酉": [
"喜神",
"司命",
"日禄"
],
"戌": [
"勾陈"
],
"亥": [
"青龙",
"旬空"
]
},
"壬申": {
"子": [
"明堂"
],
"丑": [
"旬空",
"青龙"
],
"寅": [
"明堂",
"日马",
"路空"
],
"卯": [
"日刑",
"天刑"
],
"辰": [
"路空"
],
"巳": [
"福星贵人",
"金匮"
],
"午": [
"天乙贵人"
],
"未": [
"日合",
"宝光"
],
"申": [
"白虎",
"天官贵人"
],
"酉": [
"玉堂"
],
"戌": [
"日建"
],
"亥": [
"天牢",
"元武",
"司命"
]
},
"癸酉": {
"子": [
"日禄",
"司命",
"路空"
],
"丑": [
"路空",
"勾陈"
],
"寅": [
"青龙"
],
"卯": [
"天乙贵人",
"福星贵人",
"明堂"
],
"辰": [
"日破",
"喜神",
"天官贵人"
],
"巳": [
"天刑"
],
"未": [
"朱雀",
"金匮"
],
"酉": [
"白虎",
"日建"
],
"戌": [
"玉堂",
"日刑",
"天官贵人",
"路空"
],
"亥": [
"天牢",
"旬空",
"日马"
]
},
"甲戌": {
"丑": [
"旬空",
"天牢"
],
"寅": [
"天乙贵人",
"元武",
"日禄"
],
"辰": [
"司命"
],
"午": [
"青龙",
"日破"
],
"未": [
"明堂",
"五不遇",
"天刑"
],
"申": [
"天乙贵人",
"日刑",
"朱雀"
],
"酉": [
"日马",
"金匮",
"路空",
"旬空"
],
"戌": [
"宝光"
]
},
"乙亥": {
"子": [
"旬空",
"日建"
],
"丑": [
"白虎",
"玉堂"
],
"寅": [
"日合",
"天牢"
],
"卯": [
"日禄",
"元武"
],
"辰": [
"司命"
],
"巳": [
"日马",
"五不遇",
"日破"
],
"午": [
"青龙",
"路空"
],
"未": [
"明堂",
"路空"
],
"申": [
"天乙贵人",
"天官贵人",
"日害",
"天刑"
],
"酉": [
"旬空",
"朱雀"
],
"戌": [
"旬空",
"喜神"
],
"亥": [
"金匮",
"福星贵人",
"日建"
]
},
"丙子": {
"子": [
"日刑",
"天官贵人"
],
"丑": [
"日建"
],
"寅": [
"日合"
],
"卯": [
"日马"
],
"辰": [
"玉堂",
"日刑"
],
"巳": [
"路空",
"天牢"
],
"午": [
"路空"
],
"未": [
"司命"
],
"申": [
"日害",
"勾陈"
],
"酉": [
"青龙",
"旬空"
],
"戌": [
"明堂"
],
"亥": [
"福星贵人"
]
},
"丁丑": {
"子": [
"天刑"
],
"丑": [
"朱雀"
],
"寅": [
"日合",
"天刑"
],
"卯": [
"日建",
"朱雀",
"金匮"
],
"午": [
"日禄",
"喜神",
"日害",
"天牢"
],
"未": [
"日破",
"元武"
],
"申": [
"司命",
"旬空"
],
"酉": [
"天乙贵人",
"福星贵人",
"勾陈"
],
"戌": [
"旬空",
"青龙"
],
"亥": [
"日刑",
"天乙贵人",
"天官贵人"
]
},
"戊寅": {
"子": [
"日马",
"明堂"
],
"丑": [
"青龙",
"路空"
],
"寅": [
"明堂",
"路空",
"日建"
],
"卯": [
"五不遇",
"天刑"
],
"辰": [
"天官贵人"
],
"巳": [
"朱雀",
"喜神",
"金匮",
"日禄"
],
"午": [
"宝光"
],
"未": [
"日害",
"日刑"
],
"申": [
"天乙贵人",
"玉堂",
"福星贵人"
],
"酉": [
"日马",
"日破"
],
"戌": [
"天牢",
"旬空"
],
"亥": [
"元武",
"旬空",
"司命"
]
},
"己卯": {
"子": [
"路空",
"日合",
"路空"
],
"丑": [
"天乙贵人"
],
"寅": [
"司命",
"日刑",
"五不遇"
],
"卯": [
"勾陈",
"喜神"
],
"辰": [
"天官贵人"
],
"巳": [
"青龙",
"日建"
],
"午": [
"明堂",
"日害"
],
"未": [
"天刑"
],
"申": [
"朱雀",
"日禄",
"金匮"
],
"酉": [
"天乙贵人",
"路空"
],
"戌": [
"日合",
"天牢"
],
"亥": [
"五不遇",
"元武"
]
},
"庚辰": {
"子": [
"五不遇",
"天牢"
],
"丑": [
"天乙贵人",
"元武"
],
"寅": [
"日马",
"司命"
],
"卯": [
"日害",
"勾陈"
],
"辰": [
"日建",
"青龙",
"日刑"
],
"巳": [
"明堂"
],
"午": [
"天官贵人",
"福星贵人",
"路空",
"天刑"
],
"未": [
"天乙贵人",
"路空",
"朱雀"
],
"申": [
"日禄",
"金匮",
"旬空"
],
"酉": [
"日合",
"宝光",
"旬空"
],
"戌": [
"喜神",
"五不遇",
"日破",
"白虎"
],
"亥": [
"玉堂"
]
},
"辛巳": {
"子": [
"白虎"
],
"丑": [
"玉堂"
],
"寅": [
"天乙贵人",
"日害",
"天牢"
],
"卯": [
"元武"
],
"辰": [
"司命",
"路空"
],
"巳": [
"天官贵人",
"福星贵人",
"日建",
"路空",
"勾陈"
],
"午": [
"天乙贵人",
"青龙"
],
"未": [
"明堂"
],
"申": [
"喜神",
"日合",
"日刑",
"天刑",
"旬空"
],
"酉": [
"日禄",
"五不遇",
"朱雀",
"旬空"
],
"戌": [
"金匮"
],
"亥": [
"日马",
"宝光",
"日破"
]
},
"壬午": {
"子": [
"金匮",
"日破"
],
"丑": [
"天官贵人",
"宝光"
],
"寅": [
"路空"
],
"卯": [
"天乙贵人",
"玉堂"
],
"辰": [
"路空"
],
"巳": [
"天牢"
],
"午": [
"元武",
"喜神",
"日建"
],
"未": [
"司命",
"日刑"
],
"申": [
"日合",
"勾陈",
"日马",
"青龙"
],
"酉": [
"五不遇"
],
"亥": [
"旬空"
]
},
"癸未": {
"子": [
"日禄",
"朱雀",
"日禄"
],
"丑": [
"日害",
"天刑",
"路空"
],
"卯": [
"朱雀",
"金匮"
],
"辰": [
"福星贵人",
"宝光"
],
"巳": [
"喜神",
"天官贵人"
],
"未": [
"日马",
"玉堂",
"日合"
],
"申": [
"天牢",
"日建"
],
"酉": [
"五不遇"
],
"戌": [
"司命",
"旬空",
"勾陈"
],
"亥": [
"旬空"
]
},
"甲申": {
"丑": [
"青龙",
"路空"
],
"寅": [
"路空",
"青龙",
"天乙贵人",
"明堂",
"日禄",
"喜神"
],
"辰": [
"金匮"
],
"巳": [
"日合",
"宝光"
],
"午": [
"五不遇",
"白虎",
"旬空"
],
"未": [
"天乙贵人",
"玉堂",
"旬空"
],
"申": [
"日建",
"路空",
"天牢"
],
"酉": [
"天官贵人",
"路空",
"元武"
],
"戌": [
"司命"
],
"亥": [
"日害",
"勾陈"
]
},
"乙酉": {
"子": [
"天乙贵人",
"司命"
],
"丑": [
"福星贵人",
"勾陈"
],
"寅": [
"青龙"
],
"卯": [
"日禄",
"明堂",
"日破"
],
"辰": [
"日合",
"天刑"
],
"巳": [
"五不遇",
"朱雀"
],
"午": [
"金匮",
"路空",
"旬空"
],
"未": [
"宝光",
"路空",
"旬空"
],
"申": [
"天乙贵人",
"天官贵人"
],
"酉": [
"日建",
"玉堂"
],
"戌": [
"喜神",
"日害"
],
"亥": [
"福星贵人",
"日马"
]
},
"丙戌": {
"子": [
"天官贵人",
"福星贵人"
],
"卯": [
"日合"
],
"辰": [
"青龙",
"五不遇",
"路空"
],
"巳": [
"日禄",
"明堂"
],
"午": [
"天刑"
],
"未": [
"日刑",
"朱雀"
],
"申": [
"喜神",
"日马",
"金匮"
],
"酉": [
"天乙贵人",
"宝光"
],
"戌": [
"福星贵人",
"日建"
],
"亥": [
"白虎"
]
},
"丁亥": {
"寅": [
"玉堂",
"日合"
],
"卯": [
"天牢",
"五不遇"
],
"巳": [
"司命",
"日马"
],
"午": [
"勾陈",
"日禄",
"喜神"
],
"未": [
"旬空"
],
"申": [
"旬空"
],
"酉": [
"天刑",
"天乙贵人"
],
"亥": [
"朱雀",
"金匮",
"天乙贵人"
]
},
"戊子": {
"子": [
"日建",
"宝光"
],
"丑": [
"日建",
"金匮",
"路空"
],
"寅": [
"日合",
"宝光"
],
"卯": [
"日马",
"五不遇"
],
"巳": [
"玉堂"
],
"午": [
"喜神",
"天牢"
],
"未": [
"元武",
"司命",
"日破",
"旬空"
],
"申": [
"天乙贵人"
],
"戌": [
"旬空"
]
},
"己丑": {
"子": [
"天乙贵人",
"日合"
],
"丑": [
"日建",
"五不遇"
],
"寅": [
"喜神",
"天官贵人"
],
"卯": [
"金匮"
],
"辰": [
"宝光"
],
"巳": [
"白虎"
],
"午": [
"玉堂",
"日禄",
"日害",
"天牢"
],
"未": [
"旬空",
"福星贵人",
"日破"
],
"申": [
"旬空",
"天乙贵人"
],
"酉": [
"司命",
"路空"
],
"戌": [
"路空",
"勾陈"
],
"亥": [
"青龙",
"日刑",
"日马"
]
},
"庚寅": {
"子": [
"五不遇"
],
"丑": [
"五不遇"
],
"巳": [
"朱雀",
"金匮"
],
"午": [
"日害",
"日刑",
"天官贵人"
],
"未": [
"路空",
"白虎",
"旬空"
],
"申": [
"玉堂",
"路空",
"旬空"
],
"酉": [
"日禄"
],
"戌": [
"日马",
"日破",
"天牢"
],
"亥": [
"喜神"
]
},
"辛卯": {
"子": [
"五不遇"
],
"丑": [
"日合"
],
"寅": [
"天乙贵人",
"青龙"
],
"卯": [
"日建",
"明堂"
],
"辰": [
"路空",
"日害",
"天刑"
],
"巳": [
"天官贵人",
"福星贵人",
"日马",
"路空",
"朱雀"
],
"午": [
"天乙贵人",
"金匮",
"旬空"
],
"未": [
"宝光",
"旬空"
],
"申": [
"喜神",
"白虎"
],
"酉": [
"日禄",
"玉堂",
"五不遇",
"日破"
],
"戌": [
"日合",
"天牢"
],
"亥": [
"元武"
]
},
"壬辰": {
"子": [
"天牢"
],
"丑": [
"天官贵人",
"元武"
],
"寅": [
"日马",
"司命",
"路空"
],
"卯": [
"天乙贵人",
"路空",
"日害",
"勾陈"
],
"辰": [
"福星贵人",
"日建",
"青龙",
"日刑"
],
"巳": [
"天乙贵人",
"明堂"
],
"午": [
"喜神",
"天刑"
],
"未": [
"天官贵人",
"朱雀",
"旬空"
],
"申": [
"金匮",
"五不遇"
],
"酉": [
"日合",
"宝光"
],
"戌": [
"日破",
"白虎"
],
"亥": [
"日禄",
"玉堂"
]
},
"癸巳": {
"子": [
"日禄",
"路空",
"白虎"
],
"丑": [
"玉堂",
"路空"
],
"寅": [
"日害",
"天牢"
],
"卯": [
"天乙贵人",
"福星贵人",
"元武"
],
"辰": [
"喜神",
"天官贵人",
"司命"
],
"巳": [
"天乙贵人",
"日建",
"勾陈"
],
"午": [
"青龙",
"旬空"
],
"未": [
"明堂",
"五不遇",
"旬空"
],
"申": [
"日合",
"日刑",
"天刑"
],
"酉": [
"朱雀"
],
"戌": [
"天官贵人",
"金匮"
],
"亥": [
"日马",
"宝光",
"路空"
]
},
"甲午": {
"子": [
"金匮"
],
"丑": [
"天乙贵人"
],
"寅": [
"日害",
"日禄",
"喜神"
],
"辰": [
"玉堂"
],
"巳": [
"旬空"
],
"午": [
"旬空",
"日建",
"司命"
],
"未": [
"日刑",
"天乙贵人"
],
"申": [
"日合",
"勾陈",
"日马"
],
"酉": [
"青龙",
"路空"
]
},
"乙未": {
"子": [
"天刑",
"朱雀"
],
"丑": [
"日害",
"天刑"
],
"卯": [
"日刑"
],
"辰": [
"金匮"
],
"巳": [
"宝光",
"白虎",
"旬空",
"日马"
],
"午": [
"玉堂",
"五不遇"
],
"未": [
"日合",
"路空"
],
"申": [
"日建",
"路空",
"元武"
],
"戌": [
"喜神",
"青龙"
],
"亥": [
"福星贵人"
]
},
"丙申": {
"子": [
"天官贵人"
],
"寅": [
"明堂",
"日马",
"日破"
],
"辰": [
"朱雀",
"金匮",
"五不遇"
],
"巳": [
"旬空",
"日禄",
"日合",
"宝光"
],
"申": [
"玉堂",
"喜神"
],
"酉": [
"天牢"
],
"戌": [
"元武"
],
"亥": [
"司命"
]
},
"丁酉": {
"丑": [
"日害"
],
"寅": [
"勾陈",
"司命"
],
"卯": [
"勾陈",
"青龙",
"路空",
"明堂"
],
"辰": [
"路空",
"日破"
],
"巳": [
"日合",
"天刑"
],
"午": [
"旬空",
"朱雀",
"旬空"
],
"未": [
"日禄"
],
"申": [
"喜神"
],
"酉": [
"金匮",
"宝光",
"白虎",
"天乙贵人"
],
"戌": [
"日建"
],
"亥": [
"玉堂",
"日刑",
"日害",
"天牢"
]
},
"戊戌": {
"子": [
"路空",
"天牢"
],
"丑": [
"天乙贵人",
"路空"
],
"寅": [
"司命"
],
"卯": [
"天官贵人",
"日合"
],
"辰": [
"勾陈",
"喜神",
"青龙",
"日破"
],
"巳": [
"旬空",
"日禄",
"明堂"
],
"午": [
"旬空"
],
"未": [
"天刑",
"天乙贵人"
],
"申": [
"朱雀",
"福星贵人"
],
"酉": [
"日马",
"金匮"
],
"戌": [
"宝光",
"日害",
"日建"
],
"亥": [
"路空",
"白虎"
]
},
"己亥": {
"子": [
"玉堂",
"路空"
],
"丑": [
"白虎"
],
"寅": [
"玉堂",
"五不遇",
"喜神"
],
"辰": [
"日合",
"天牢"
],
"巳": [
"元武",
"司命",
"旬空",
"日马"
],
"午": [
"日破",
"勾陈"
],
"未": [
"旬空",
"日禄"
],
"申": [
"福星贵人",
"明堂"
],
"酉": [
"路空"
],
"戌": [
"日害"
],
"亥": [
"天刑",
"路空",
"朱雀",
"金匮"
]
},
"庚子": {
"子": [
"宝光",
"五不遇"
],
"丑": [
"日建",
"金匮"
],
"卯": [
"日合"
],
"辰": [
"天牢",
"旬空"
],
"巳": [
"元武",
"旬空"
],
"午": [
"天官贵人",
"福星贵人",
"司命",
"路空"
],
"未": [
"日破",
"天乙贵人",
"路空"
],
"申": [
"勾陈"
],
"戌": [
"明堂",
"喜神"
]
},
"辛丑": {
"子": [
"朱雀"
],
"丑": [
"天刑"
],
"寅": [
"朱雀"
],
"辰": [
"金匮",
"宝光",
"路空"
],
"巳": [
"白虎",
"旬空",
"天官贵人",
"福星贵人"
],
"午": [
"玉堂",
"路空",
"旬空"
],
"申": [
"天牢"
],
"酉": [
"元武",
"喜神",
"司命"
],
"戌": [
"日禄"
],
"亥": [
"勾陈"
]
},
"壬寅": {
"丑": [
"日马",
"明堂"
],
"寅": [
"天官贵人"
],
"卯": [
"日建",
"路空",
"天刑"
],
"辰": [
"路空",
"朱雀"
],
"巳": [
"福星贵人",
"金匮",
"旬空",
"天乙贵人"
],
"午": [
"宝光",
"日害"
],
"未": [
"日刑",
"旬空",
"喜神"
],
"申": [
"日马",
"五不遇",
"日破",
"天牢"
],
"酉": [
"元武"
],
"戌": [
"司命"
],
"亥": [
"日禄",
"日合",
"勾陈"
]
},
"癸卯": {
"子": [
"日禄",
"司命",
"路空",
"日刑"
],
"丑": [
"路空",
"勾陈"
],
"寅": [
"青龙"
],
"卯": [
"天乙贵人",
"福星贵人",
"日建"
],
"辰": [
"喜神",
"天官贵人",
"日害",
"天刑"
],
"巳": [
"旬空",
"天乙贵人",
"日马"
],
"未": [
"金匮",
"宝光"
],
"酉": [
"白虎"
],
"戌": [
"日破",
"天官贵人",
"日合"
],
"亥": [
"路空",
"天牢"
]
},
"甲辰": {
"子": [
"路空"
],
"丑": [
"元武",
"天牢"
],
"寅": [
"元武",
"日禄",
"喜神",
"福星贵人"
],
"卯": [
"司命",
"旬空"
],
"辰": [
"勾陈",
"旬空"
],
"午": [
"日刑",
"明堂"
],
"未": [
"五不遇",
"天刑"
],
"申": [
"天乙贵人"
],
"酉": [
"朱雀",
"金匮",
"路空"
],
"戌": [
"日合"
]
},
"乙巳": {
"子": [
"天乙贵人",
"白虎"
],
"丑": [
"福星贵人",
"玉堂"
],
"寅": [
"日害",
"天牢",
"旬空"
],
"卯": [
"日禄",
"元武",
"旬空"
],
"辰": [
"司命"
],
"巳": [
"日建",
"五不遇",
"勾陈"
],
"午": [
"青龙",
"路空"
],
"未": [
"明堂",
"路空"
],
"申": [
"天乙贵人",
"天官贵人",
"日合",
"日刑",
"天刑"
],
"酉": [
"朱雀"
],
"戌": [
"喜神",
"金匮"
],
"亥": [
"福星贵人",
"日马",
"宝光",
"日破"
]
},
"丙午": {
"子": [
"天官贵人",
"福星贵人",
"金匮",
"日破"
],
"丑": [
"宝光",
"日害"
],
"寅": [
"白虎",
"旬空"
],
"卯": [
"玉堂",
"旬空"
],
"辰": [
"五不遇",
"路空",
"天牢"
],
"巳": [
"日禄",
"路空",
"元武"
],
"午": [
"日建",
"司命",
"日刑"
],
"未": [
"日合",
"勾陈"
],
"申": [
"喜神",
"日马",
"青龙"
],
"酉": [
"天乙贵人",
"明堂"
],
"戌": [
"福星贵人",
"天刑"
],
"亥": [
"天乙贵人",
"朱雀"
]
},
"丁未": {
"子": [
"日害",
"天刑"
],
"丑": [
"日破",
"日刑",
"朱雀"
],
"寅": [
"金匮",
"路空",
"旬空"
],
"卯": [
"宝光",
"五不遇",
"路空",
"旬空"
],
"辰": [
"白虎"
],
"巳": [
"日马",
"玉堂"
],
"午": [
"日禄",
"喜神",
"日合",
"天牢"
],
"未": [
"日建",
"元武"
],
"申": [
"司命"
],
"酉": [
"天乙贵人",
"福星贵人"
],
"戌": [
"勾陈"
],
"亥": [
"青龙",
"天乙贵人"
]
},
"戊申": {
"子": [
"明堂"
],
"丑": [
"青龙",
"路空"
],
"寅": [
"明堂",
"路空",
"日马",
"五不遇",
"日破"
],
"卯": [
"天刑",
"旬空"
],
"辰": [
"朱雀"
],
"巳": [
"旬空",
"喜神",
"金匮"
],
"午": [
"日禄"
],
"未": [
"日合",
"宝光"
],
"申": [
"天乙贵人",
"玉堂"
],
"戌": [
"日建"
],
"亥": [
"天牢",
"元武",
"司命"
]
},
"己酉": {
"子": [
"路空",
"路空"
],
"丑": [
"勾陈"
],
"寅": [
"司命",
"五不遇",
"勾陈"
],
"卯": [
"喜神",
"天官贵人"
],
"辰": [
"青龙",
"旬空"
],
"巳": [
"明堂"
],
"午": [
"日禄",
"金匮"
],
"未": [
"福星贵人"
],
"申": [
"天乙贵人",
"路空"
],
"酉": [
"白虎",
"日建",
"玉堂",
"路空"
],
"戌": [
"日刑",
"日害"
],
"亥": [
"天牢",
"日马",
"五不遇"
]
},
"庚戌": {
"子": [
"元武",
"五不遇"
],
"丑": [
"天牢"
],
"寅": [
"元武"
],
"卯": [
"旬空",
"日合"
],
"辰": [
"旬空"
],
"午": [
"明堂",
"天官贵人"
],
"未": [
"路空",
"天刑",
"天乙贵人"
],
"申": [
"路空",
"日刑",
"朱雀"
],
"酉": [
"日禄",
"日马"
],
"戌": [
"金匮",
"宝光",
"日害",
"喜神"
]
},
"辛亥": {
"丑": [
"白虎"
],
"寅": [
"玉堂",
"白虎",
"玉堂"
],
"卯": [
"日合"
],
"辰": [
"天牢",
"旬空"
],
"巳": [
"元武",
"旬空",
"司命",
"路空",
"天官贵人"
],
"午": [
"日马"
],
"申": [
"勾陈"
],
"酉": [
"青龙",
"明堂",
"喜神"
],
"戌": [
"天刑"
],
"亥": [
"日禄",
"朱雀"
]
},
"癸丑": {
"子": [
"日禄",
"日合",
"路空",
"天刑"
],
"丑": [
"日建",
"路空",
"朱雀"
],
"寅": [
"金匮",
"旬空"
],
"卯": [
"天乙贵人",
"福星贵人",
"宝光"
],
"辰": [
"旬空",
"喜神"
],
"巳": [
"白虎"
],
"未": [
"玉堂",
"日害",
"五不遇"
],
"申": [
"日破"
],
"戌": [
"司命",
"勾陈",
"天官贵人"
],
"亥": [
"路空",
"日刑"
]
},
"甲寅": {
"子": [
"明堂"
],
"丑": [
"青龙",
"旬空"
],
"寅": [
"明堂",
"旬空",
"日禄",
"喜神"
],
"巳": [
"天刑",
"朱雀"
],
"午": [
"宝光",
"日害"
],
"未": [
"日刑",
"五不遇"
],
"申": [
"白虎",
"天乙贵人",
"玉堂"
],
"酉": [
"日马",
"路空",
"日破"
]
},
"乙卯": {
"子": [
"天乙贵人",
"司命",
"日刑"
],
"丑": [
"福星贵人",
"勾陈"
],
"寅": [
"旬空"
],
"卯": [
"青龙",
"日禄",
"日建"
],
"辰": [
"明堂",
"日害"
],
"巳": [
"天刑",
"日马",
"五不遇"
],
"午": [
"朱雀",
"金匮"
],
"未": [
"路空",
"宝光"
],
"申": [
"路空",
"天乙贵人"
],
"酉": [
"白虎"
],
"戌": [
"日破",
"喜神"
],
"亥": [
"日合",
"天牢"
]
},
"丙辰": {
"子": [
"元武",
"天官贵人"
],
"寅": [
"旬空"
],
"卯": [
"旬空"
],
"辰": [
"司命",
"日害",
"勾陈",
"日建",
"青龙"
],
"巳": [
"五不遇",
"路空"
],
"申": [
"路空"
],
"酉": [
"朱雀",
"喜神",
"金匮"
],
"戌": [
"天乙贵人",
"日合"
],
"亥": [
"福星贵人"
]
},
"丁巳": {
"子": [
"日破",
"白虎"
],
"丑": [
"天乙贵人"
],
"寅": [
"玉堂",
"白虎",
"旬空"
],
"卯": [
"玉堂",
"旬空",
"路空"
],
"辰": [
"司命"
],
"巳": [
"日建",
"勾陈"
],
"午": [
"日禄",
"喜神",
"青龙"
],
"未": [
"明堂"
],
"申": [
"日合",
"日刑",
"天刑"
],
"酉": [
"天乙贵人",
"福星贵人"
],
"亥": [
"天乙贵人",
"天官贵人",
"日马",
"宝光"
]
},
"戊午": {
"子": [
"日破",
"金匮",
"路空",
"日破"
],
"丑": [
"旬空",
"天乙贵人",
"宝光",
"路空",
"日害"
],
"寅": [
"旬空",
"五不遇"
],
"卯": [
"白虎",
"天官贵人"
],
"辰": [
"玉堂",
"喜神"
],
"巳": [
"天牢",
"日禄"
],
"午": [
"元武",
"日建",
"司命"
],
"未": [
"日刑",
"天乙贵人"
],
"申": [
"勾陈",
"福星贵人"
],
"酉": [
"日马"
],
"戌": [
"青龙",
"明堂"
],
"亥": [
"路空",
"天刑"
]
},
"己未": {
"子": [
"路空",
"朱雀",
"天乙贵人"
],
"丑": [
"天刑",
"旬空",
"五不遇",
"日破"
],
"寅": [
"朱雀",
"旬空",
"喜神"
],
"巳": [
"金匮",
"宝光"
],
"午": [
"白虎",
"日马",
"玉堂"
],
"未": [
"日禄",
"日合",
"天牢"
],
"申": [
"天乙贵人",
"司命",
"路空"
],
"酉": [
"路空",
"勾陈"
],
"戌": [
"青龙"
],
"亥": [
"明堂",
"五不遇"
]
},
"庚申": {
"子": [
"青龙",
"五不遇",
"旬空"
],
"丑": [
"天乙贵人",
"明堂",
"旬空"
],
"寅": [
"日马",
"日破",
"日刑",
"天刑"
],
"卯": [
"朱雀"
],
"辰": [
"金匮"
],
"巳": [
"日合",
"宝光"
],
"午": [
"天官贵人",
"福星贵人",
"路空",
"白虎"
],
"未": [
"天乙贵人",
"路空"
],
"申": [
"日禄",
"日建",
"天牢"
],
"酉": [
"元武"
],
"戌": [
"喜神",
"司命",
"五不遇"
],
"亥": [
"日害",
"勾陈"
]
},
"辛酉": {
"子": [
"司命",
"旬空"
],
"丑": [
"勾陈",
"旬空"
],
"寅": [
"天乙贵人",
"青龙"
],
"卯": [
"明堂",
"日破"
],
"辰": [
"日合",
"路空",
"天刑"
],
"巳": [
"天官贵人",
"福星贵人",
"路空",
"朱雀"
],
"午": [
"天乙贵人",
"金匮"
],
"未": [
"宝光"
],
"申": [
"喜神",
"白虎"
],
"酉": [
"日禄",
"日建",
"玉堂",
"五不遇",
"日刑"
],
"戌": [
"日害",
"天牢"
],
"亥": [
"日马",
"元武"
]
},
"壬戌": {
"子": [
"天牢",
"旬空"
],
"丑": [
"天官贵人",
"元武"
],
"寅": [
"司命"
],
"卯": [
"天乙贵人",
"日合",
"路空"
],
"辰": [
"勾陈",
"福星贵人"
],
"巳": [
"日破"
],
"午": [
"明堂"
],
"未": [
"喜神",
"天刑"
],
"申": [
"日刑",
"朱雀",
"日马"
],
"酉": [
"金匮"
],
"戌": [
"宝光"
],
"亥": [
"日建"
]
},
"癸亥": {
"子": [
"日禄",
"玉堂",
"日禄"
],
"丑": [
"白虎",
"旬空"
],
"寅": [
"路空"
],
"卯": [
"日合",
"天牢",
"天乙贵人"
],
"辰": [
"福星贵人",
"元武"
],
"巳": [
"天官贵人",
"司命"
],
"未": [
"日马",
"日破"
],
"申": [
"青龙"
],
"戌": [
"日害",
"天刑"
],
"亥": [
"天官贵人",
"金匮"
]
}
},
"guideng": {
"雨水": {
"甲": [
"卯",
"酉"
],
"乙": [
"戌"
],
"丙": [
"亥"
],
"丁": [
"丑"
],
"戊": [
"酉",
"卯"
],
"庚": [
"酉",
"卯"
],
"辛": [
"申"
],
"壬": [
"未"
],
"癸": [
"巳"
]
},
"春分": {
"乙": [
"酉"
],
"丙": [
"戌"
],
"丁": [
"子"
],
"戊": [
"申",
"寅",
"丑"
],
"庚": [
"申",
"寅"
],
"辛": [
"未",
"卯"
],
"壬": [
"午"
],
"癸": [
"辰"
]
},
"谷雨": {
"丁": [
"酉",
"亥"
],
"戊": [
"未",
"丑",
"子"
],
"庚": [
"未",
"丑"
],
"辛": [
"午",
"寅"
],
"壬": [
"巳"
],
"癸": [
"卯"
]
},
"小满": {
"丙": [
"戌"
],
"丁": [
"申",
"戌"
],
"戊": [
"午",
"子",
"亥"
],
"庚": [
"午",
"子"
],
"辛": [
"巳",
"丑"
],
"壬": [
"辰",
"寅"
],
"癸": [
"寅"
]
},
"夏至": {
"乙": [
"戌"
],
"丙": [
"酉"
],
"丁": [
"未"
],
"戊": [
"巳",
"亥",
"戌"
],
"庚": [
"巳",
"亥"
],
"辛": [
"辰",
"子"
],
"壬": [
"卯",
"丑"
]
},
"大暑": {
"乙": [
"酉"
],
"丙": [
"申"
],
"丁": [
"午"
],
"戊": [
"辰",
"戌"
],
"庚": [
"辰",
"戌"
],
"辛": [
"卯",
"亥"
],
"壬": [
"寅",
"子"
],
"癸": [
"寅"
]
},
"处暑": {
"甲": [
"酉"
],
"乙": [
"申"
],
"丙": [
"未"
],
"丁": [
"巳"
],
"戊": [
"卯",
"酉"
],
"庚": [
"卯",
"酉"
],
"辛": [
"戌"
],
"壬": [
"亥"
],
"癸": [
"丑"
]
},
"秋分": {
"甲": [
"申",
"寅"
],
"乙": [
"未",
"卯"
],
"丙": [
"午"
],
"丁": [
"辰"
],
"辛": [
"酉"
],
"壬": [
"戌"
],
"癸": [
"子"
]
},
"霜降": {
"甲": [
"未",
"丑"
],
"乙": [
"午",
"寅"
],
"丙": [
"巳",
"卯"
],
"丁": [
"卯"
],
"壬": [
"酉"
],
"癸": [
"酉",
"亥"
]
},
"小雪": {
"甲": [
"午",
"子"
],
"乙": [
"巳",
"丑"
],
"丙": [
"辰",
"寅"
],
"癸": [
"申",
"戌"
]
},
"冬至": {
"甲": [
"巳",
"亥"
],
"乙": [
"辰",
"子"
],
"丙": [
"丑"
],
"丁": [
"卯"
],
"癸": [
"未",
"酉"
]
},
"大寒": {
"甲": [
"辰",
"戌"
],
"乙": [
"卯",
"亥"
],
"丙": [
"子"
],
"丁": [
"寅"
],
"己": [
"卯"
],
"壬": [
"申"
],
"癸": [
"午",
"申"
]
}
},
"sidaji": {
"雨水": {
"甲": [
[
"甲",
"勾陈"
],
[
"丙",
"勾陈"
],
[
"庚",
"太常"
],
[
"壬",
"太隂"
]
],
"乙": [
[
"甲",
"六合"
],
[
"丙",
"六合"
],
[
"庚",
"元武"
],
[
"壬",
"天后"
]
],
"丙": [
[
"甲",
"朱雀"
],
[
"丙",
"朱雀"
],
[
"庚",
"太隂"
],
[
"壬",
"天乙"
]
],
"丁": [
[
"甲",
"天乙"
],
[
"丙",
"天乙"
],
[
"庚",
"天乙"
],
[
"壬",
"太隂"
]
],
"戊": [
[
"甲",
"朱雀"
],
[
"丙",
"朱雀"
],
[
"庚",
"太隂"
],
[
"壬",
"太常"
]
],
"庚": [
[
"甲",
"朱雀"
],
[
"丙",
"朱雀"
],
[
"庚",
"太隂"
],
[
"壬",
"太常"
]
],
"己": [
[
"甲",
"天后"
],
[
"丙",
"螣蛇"
],
[
"庚",
"螣蛇"
],
[
"壬",
"元武"
]
],
"辛": [
[
"甲",
"六合"
],
[
"丙",
"六合"
],
[
"庚",
"元武"
],
[
"壬",
"白虎"
]
],
"壬": [
[
"甲",
"勾陈"
],
[
"丙",
"勾陈"
],
[
"庚",
"太常"
],
[
"壬",
"天空"
]
],
"癸": [
[
"甲",
"天空"
],
[
"丙",
"天空"
],
[
"庚",
"天空"
],
[
"壬",
"太常"
]
]
},
"春分": {
"甲": [
[
"艮",
"六合"
],
[
"巽",
"六合"
],
[
"坤",
"元武"
],
[
"乾",
"元武"
]
],
"乙": [
[
"艮",
"太隂"
],
[
"巽",
"朱雀"
],
[
"坤",
"太隂"
],
[
"乾",
"太隂"
]
],
"丙": [
[
"艮",
"天后"
],
[
"巽",
"螣蛇"
],
[
"坤",
"天后"
],
[
"乾",
"天后"
]
],
"丁": [
[
"艮",
"螣蛇"
],
[
"巽",
"螣蛇"
],
[
"坤",
"螣蛇"
],
[
"乾",
"天后"
]
],
"戊": [
[
"艮",
"六合"
],
[
"巽",
"六合"
],
[
"坤",
"元武"
],
[
"乾",
"元武"
]
],
"庚": [
[
"艮",
"六合"
],
[
"巽",
"六合"
],
[
"坤",
"元武"
],
[
"乾",
"元武"
]
],
"己": [
[
"艮",
"朱雀"
],
[
"巽",
"朱雀"
],
[
"坤",
"朱雀"
],
[
"乾",
"太隂"
]
],
"辛": [
[
"艮",
"太常"
],
[
"巽",
"勾陈"
],
[
"坤",
"太常"
],
[
"乾",
"太常"
]
],
"壬": [
[
"艮",
"白虎"
],
[
"巽",
"青龙"
],
[
"坤",
"白虎"
],
[
"乾",
"白虎"
]
],
"癸": [
[
"艮",
"青龙"
],
[
"巽",
"青龙"
],
[
"坤",
"青龙"
],
[
"乾",
"白虎"
]
]
},
"谷雨": {
"甲": [
[
"癸",
"勾陈"
],
[
"乙",
"朱雀"
],
[
"丁",
"太隂"
],
[
"辛",
"太隂"
]
],
"乙": [
[
"癸",
"元武"
],
[
"乙",
"螣蛇"
],
[
"丁",
"天后"
],
[
"辛",
"天后"
]
],
"丙": [
[
"癸",
"太隂"
],
[
"乙",
"天乙"
],
[
"丁",
"天乙"
],
[
"辛",
"天乙"
]
],
"丁": [
[
"癸",
"天乙"
],
[
"乙",
"朱雀"
],
[
"丁",
"朱雀"
],
[
"辛",
"太隂"
]
],
"戊": [
[
"癸",
"朱雀"
],
[
"乙",
"勾陈"
],
[
"丁",
"太常"
],
[
"辛",
"太常"
]
],
"庚": [
[
"癸",
"朱雀"
],
[
"乙",
"勾陈"
],
[
"丁",
"太常"
],
[
"辛",
"太常"
]
],
"己": [
[
"癸",
"螣蛇"
],
[
"乙",
"六合"
],
[
"丁",
"六合"
],
[
"辛",
"元武"
]
],
"辛": [
[
"癸",
"元武"
],
[
"乙",
"青龙"
],
[
"丁",
"白虎"
],
[
"辛",
"白虎"
]
],
"壬": [
[
"癸",
"太常"
],
[
"乙",
"天空"
],
[
"丁",
"天空"
],
[
"辛",
"天空"
]
],
"癸": [
[
"癸",
"天空"
],
[
"乙",
"勾陈"
],
[
"丁",
"勾陈"
],
[
"辛",
"太常"
]
]
},
"小满": {
"甲": [
[
"甲",
"螣蛇"
],
[
"丙",
"天后"
],
[
"庚",
"天后"
],
[
"壬",
"青龙"
]
],
"乙": [
[
"甲",
"天乙"
],
[
"丙",
"天乙"
],
[
"庚",
"天乙"
],
[
"壬",
"太常"
]
],
"丙": [
[
"甲",
"天后"
],
[
"丙",
"螣蛇"
],
[
"庚",
"螣蛇"
],
[
"壬",
"元武"
]
],
"丁": [
[
"甲",
"六合"
],
[
"丙",
"六合"
],
[
"庚",
"元武"
],
[
"壬",
"天后"
]
],
"戊": [
[
"甲",
"青龙"
],
[
"丙",
"白虎"
],
[
"庚",
"白虎"
],
[
"壬",
"螣蛇"
]
],
"庚": [
[
"甲",
"青龙"
],
[
"丙",
"白虎"
],
[
"庚",
"白虎"
],
[
"壬",
"螣蛇"
]
],
"己": [
[
"甲",
"勾陈"
],
[
"丙",
"勾陈"
],
[
"庚",
"太常"
],
[
"壬",
"天乙"
]
],
"辛": [
[
"甲",
"天空"
],
[
"丙",
"天空"
],
[
"庚",
"天空"
],
[
"壬",
"太隂"
]
],
"壬": [
[
"甲",
"白虎"
],
[
"丙",
"青龙"
],
[
"庚",
"青龙"
],
[
"壬",
"元武"
]
],
"癸": [
[
"甲",
"六合"
],
[
"丙",
"六合"
],
[
"庚",
"元武"
],
[
"壬",
"白虎"
]
]
},
"夏至": {
"甲": [
[
"艮",
"天乙"
],
[
"巽",
"天乙"
],
[
"坤",
"天乙"
],
[
"乾",
"天乙"
]
],
"乙": [
[
"艮",
"天后"
],
[
"巽",
"螣蛇"
],
[
"坤",
"螣蛇"
],
[
"乾",
"天后"
]
],
"丙": [
[
"艮",
"太隂"
],
[
"巽",
"朱雀"
],
[
"坤",
"朱雀"
],
[
"乾",
"太隂"
]
],
"丁": [
[
"艮",
"勾陈"
],
[
"巽",
"勾陈"
],
[
"坤",
"太常"
],
[
"乾",
"太常"
]
],
"戊": [
[
"艮",
"天空"
],
[
"巽",
"天空"
],
[
"坤",
"天空"
],
[
"乾",
"天空"
]
],
"庚": [
[
"艮",
"天空"
],
[
"巽",
"天空"
],
[
"坤",
"天空"
],
[
"乾",
"天空"
]
],
"己": [
[
"艮",
"青龙"
],
[
"巽",
"青龙"
],
[
"坤",
"白虎"
],
[
"乾",
"白虎"
]
],
"辛": [
[
"艮",
"白虎"
],
[
"巽",
"青龙"
],
[
"坤",
"青龙"
],
[
"乾",
"白虎"
]
],
"壬": [
[
"艮",
"太常"
],
[
"巽",
"勾陈"
],
[
"坤",
"勾陈"
],
[
"乾",
"太常"
]
],
"癸": [
[
"艮",
"朱雀"
],
[
"巽",
"朱雀"
],
[
"坤",
"太隂"
],
[
"乾",
"太隂"
]
]
},
"大暑": {
"甲": [
[
"癸",
"白虎"
],
[
"乙",
"螣蛇"
],
[
"丁",
"螣蛇"
],
[
"辛",
"天后"
]
],
"乙": [
[
"癸",
"天空"
],
[
"乙",
"朱雀"
],
[
"丁",
"朱雀"
],
[
"辛",
"太隂"
]
],
"丙": [
[
"癸",
"青龙"
],
[
"乙",
"六合"
],
[
"丁",
"六合"
],
[
"辛",
"元武"
]
],
"丁": [
[
"癸",
"元武"
],
[
"乙",
"青龙"
],
[
"丁",
"白虎"
],
[
"辛",
"白虎"
]
],
"戊": [
[
"癸",
"天后"
],
[
"乙",
"青龙"
],
[
"丁",
"青龙"
],
[
"辛",
"白虎"
]
],
"庚": [
[
"癸",
"天后"
],
[
"乙",
"青龙"
],
[
"丁",
"青龙"
],
[
"辛",
"白虎"
]
],
"己": [
[
"癸",
"太隂"
],
[
"乙",
"天空"
],
[
"丁",
"天空"
],
[
"辛",
"天空"
]
],
"辛": [
[
"癸",
"天乙"
],
[
"乙",
"勾陈"
],
[
"丁",
"勾陈"
],
[
"辛",
"太常"
]
],
"壬": [
[
"癸",
"螣蛇"
],
[
"乙",
"六合"
],
[
"丁",
"六合"
],
[
"辛",
"元武"
]
],
"癸": [
[
"癸",
"元武"
],
[
"乙",
"螣蛇"
],
[
"丁",
"天后"
],
[
"辛",
"天后"
]
]
},
"处暑": {
"甲": [
[
"甲",
"朱雀"
],
[
"丙",
"朱雀"
],
[
"庚",
"太隂"
],
[
"壬",
"太常"
]
],
"乙": [
[
"甲",
"六合"
],
[
"丙",
"六合"
],
[
"庚",
"元武"
],
[
"壬",
"白虎"
]
],
"丙": [
[
"甲",
"勾陈"
],
[
"丙",
"勾陈"
],
[
"庚",
"太常"
],
[
"壬",
"天空"
]
],
"丁": [
[
"甲",
"天空"
],
[
"丙",
"天空"
],
[
"庚",
"天空"
],
[
"壬",
"太常"
]
],
"戊": [
[
"甲",
"勾陈"
],
[
"丙",
"勾陈"
],
[
"庚",
"太常"
],
[
"壬",
"太隂"
]
],
"庚": [
[
"甲",
"勾陈"
],
[
"丙",
"勾陈"
],
[
"庚",
"太常"
],
[
"壬",
"太隂"
]
],
"己": [
[
"甲",
"白虎"
],
[
"丙",
"青龙"
],
[
"庚",
"青龙"
],
[
"壬",
"元武"
]
],
"辛": [
[
"甲",
"六合"
],
[
"丙",
"六合"
],
[
"庚",
"元武"
],
[
"壬",
"天后"
]
],
"壬": [
[
"甲",
"朱雀"
],
[
"丙",
"朱雀"
],
[
"庚",
"太隂"
],
[
"壬",
"天乙"
]
],
"癸": [
[
"甲",
"天乙"
],
[
"丙",
"天乙"
],
[
"庚",
"天乙"
],
[
"壬",
"太隂"
]
]
},
"秋分": {
"甲": [
[
"艮",
"六合"
],
[
"巽",
"六合"
],
[
"坤",
"元武"
],
[
"乾",
"元武"
]
],
"乙": [
[
"艮",
"太常"
],
[
"巽",
"勾陈"
],
[
"坤",
"太常"
],
[
"乾",
"太常"
]
],
"丙": [
[
"艮",
"白虎"
],
[
"巽",
"青龙"
],
[
"坤",
"白虎"
],
[
"乾",
"白虎"
]
],
"丁": [
[
"艮",
"青龙"
],
[
"巽",
"青龙"
],
[
"坤",
"青龙"
],
[
"乾",
"白虎"
]
],
"戊": [
[
"艮",
"六合"
],
[
"巽",
"六合"
],
[
"坤",
"元武"
],
[
"乾",
"元武"
]
],
"庚": [
[
"艮",
"六合"
],
[
"巽",
"六合"
],
[
"坤",
"元武"
],
[
"乾",
"元武"
]
],
"己": [
[
"艮",
"勾陈"
],
[
"巽",
"勾陈"
],
[
"坤",
"勾陈"
],
[
"乾",
"太常"
]
],
"辛": [
[
"艮",
"太隂"
],
[
"巽",
"朱雀"
],
[
"坤",
"太隂"
],
[
"乾",
"太隂"
]
],
"壬": [
[
"艮",
"天后"
],
[
"巽",
"螣蛇"
],
[
"坤",
"天后"
],
[
"乾",
"天后"
]
],
"癸": [
[
"艮",
"螣蛇"
],
[
"巽",
"螣蛇"
],
[
"坤",
"螣蛇"
],
[
"乾",
"天后"
]
]
},
"霜降": {
"甲": [
[
"癸",
"朱雀"
],
[
"乙",
"勾陈"
],
[
"丁",
"太常"
],
[
"辛",
"太隂"
]
],
"乙": [
[
"癸",
"元武"
],
[
"乙",
"青龙"
],
[
"丁",
"白虎"
],
[
"辛",
"元武"
]
],
"丙": [
[
"癸",
"太常"
],
[
"乙",
"天空"
],
[
"丁",
"天空"
],
[
"辛",
"太常"
]
],
"丁": [
[
"癸",
"天空"
],
[
"乙",
"勾陈"
],
[
"丁",
"勾陈"
],
[
"辛",
"天空"
]
],
"戊": [
[
"癸",
"勾陈"
],
[
"乙",
"朱雀"
],
[
"丁",
"太隂"
],
[
"辛",
"太常"
]
],
"庚": [
[
"癸",
"勾陈"
],
[
"乙",
"朱雀"
],
[
"丁",
"太隂"
],
[
"辛",
"太常"
]
],
"己": [
[
"癸",
"青龙"
],
[
"乙",
"六合"
],
[
"丁",
"六合"
],
[
"辛",
"白虎"
]
],
"辛": [
[
"癸",
"元武"
],
[
"乙",
"螣蛇"
],
[
"丁",
"天后"
],
[
"辛",
"元武"
]
],
"壬": [
[
"癸",
"太隂"
],
[
"乙",
"天乙"
],
[
"丁",
"天乙"
],
[
"辛",
"太隂"
]
],
"癸": [
[
"癸",
"天乙"
],
[
"乙",
"朱雀"
],
[
"丁",
"朱雀"
],
[
"辛",
"天乙"
]
]
},
"小雪": {
"甲": [
[
"甲",
"螣蛇"
],
[
"丙",
"白虎"
],
[
"庚",
"白虎"
],
[
"壬",
"螣蛇"
]
],
"乙": [
[
"甲",
"朱雀"
],
[
"丙",
"天空"
],
[
"庚",
"天空"
],
[
"壬",
"太隂"
]
],
"丙": [
[
"甲",
"六合"
],
[
"丙",
"青龙"
],
[
"庚",
"青龙"
],
[
"壬",
"元武"
]
],
"丁": [
[
"甲",
"白虎"
],
[
"丙",
"六合"
],
[
"庚",
"元武"
],
[
"壬",
"白虎"
]
],
"戊": [
[
"甲",
"青龙"
],
[
"丙",
"天后"
],
[
"庚",
"天后"
],
[
"壬",
"青龙"
]
],
"庚": [
[
"甲",
"青龙"
],
[
"丙",
"天后"
],
[
"庚",
"天后"
],
[
"壬",
"青龙"
]
],
"己": [
[
"甲",
"天空"
],
[
"丙",
"朱雀"
],
[
"庚",
"太隂"
],
[
"壬",
"天空"
]
],
"辛": [
[
"甲",
"勾陈"
],
[
"丙",
"天乙"
],
[
"庚",
"天乙"
],
[
"壬",
"太常"
]
],
"壬": [
[
"甲",
"六合"
],
[
"丙",
"螣蛇"
],
[
"庚",
"螣蛇"
],
[
"壬",
"元武"
]
],
"癸": [
[
"甲",
"天后"
],
[
"丙",
"六合"
],
[
"庚",
"元武"
],
[
"壬",
"天后"
]
]
},
"冬至": {
"甲": [
[
"艮",
"天乙"
],
[
"巽",
"天空"
],
[
"坤",
"天空"
],
[
"乾",
"天乙"
]
],
"乙": [
[
"艮",
"螣蛇"
],
[
"巽",
"青龙"
],
[
"坤",
"青龙"
],
[
"乾",
"天后"
]
],
"丙": [
[
"艮",
"朱雀"
],
[
"巽",
"勾陈"
],
[
"坤",
"勾陈"
],
[
"乾",
"太隂"
]
],
"丁": [
[
"艮",
"太常"
],
[
"巽",
"朱雀"
],
[
"坤",
"太隂"
],
[
"乾",
"太常"
]
],
"戊": [
[
"艮",
"天空"
],
[
"巽",
"天乙"
],
[
"坤",
"天乙"
],
[
"乾",
"天空"
]
],
"庚": [
[
"艮",
"天空"
],
[
"巽",
"天乙"
],
[
"坤",
"天乙"
],
[
"乾",
"天空"
]
],
"己": [
[
"艮",
"白虎"
],
[
"巽",
"螣蛇"
],
[
"坤",
"天后"
],
[
"乾",
"白虎"
]
],
"辛": [
[
"艮",
"青龙"
],
[
"巽",
"螣蛇"
],
[
"坤",
"螣蛇"
],
[
"乾",
"白虎"
]
],
"壬": [
[
"艮",
"勾陈"
],
[
"巽",
"朱雀"
],
[
"坤",
"朱雀"
],
[
"乾",
"太常"
]
],
"癸": [
[
"艮",
"太隂"
],
[
"巽",
"勾陈"
],
[
"坤",
"太隂"
],
[
"乾",
"太隂"
]
]
},
"大寒": {
"甲": [
[
"癸",
"天后"
],
[
"乙",
"青龙"
],
[
"丁",
"青龙"
],
[
"辛",
"天后"
]
],
"乙": [
[
"癸",
"天乙"
],
[
"乙",
"勾陈"
],
[
"丁",
"勾陈"
],
[
"辛",
"天乙"
]
],
"丙": [
[
"癸",
"螣蛇"
],
[
"乙",
"六合"
],
[
"辛",
"天后"
]
],
"丁": [
[
"癸",
"元武"
],
[
"乙",
"螣蛇"
],
[
"丁",
"天后"
],
[
"辛",
"元武"
]
],
"戊": [
[
"癸",
"白虎"
],
[
"乙",
"螣蛇"
],
[
"丁",
"螣蛇"
],
[
"辛",
"太常"
]
],
"庚": [
[
"癸",
"白虎"
],
[
"乙",
"螣蛇"
],
[
"丁",
"螣蛇"
],
[
"辛",
"太常"
]
],
"己": [
[
"癸",
"太常"
],
[
"乙",
"天乙"
],
[
"丁",
"天乙"
],
[
"辛",
"白虎"
]
],
"辛": [
[
"癸",
"天空"
],
[
"乙",
"朱雀"
],
[
"丁",
"朱雀"
],
[
"辛",
"天空"
]
],
"壬": [
[
"癸",
"青龙"
],
[
"乙",
"六合"
],
[
"丁",
"六合"
],
[
"辛",
"白虎"
]
],
"癸": [
[
"癸",
"元武"
],
[
"乙",
"青龙"
],
[
"丁",
"白虎"
],
[
"辛",
"元武"
]
]
}
},
"meta": {
"days": 59,
"missing_days": [
"壬子"
],
"guideng_segs": [
"雨水",
"春分",
"谷雨",
"小满",
"夏至",
"大暑",
"处暑",
"秋分",
"霜降",
"小雪",
"冬至",
"大寒"
],
"sidaji_segs": [
"雨水",
"春分",
"谷雨",
"小满",
"夏至",
"大暑",
"处暑",
"秋分",
"霜降",
"小雪",
"冬至",
"大寒"
],
"note": "六十日时辰定局=原书各日十二时神煞值（白话重组列，残字剔除）；甲辰旬缺壬子日小节（源文缺失）；贵登天门/四大吉时按十二节气段（日躔宫）分列"
}
};